app/Http/Controllers/ClientProjectController.php

select * from `projects` where `projects`.`client_id` = 1 and `projects`.`client_id` is not null
---
    public function index(Client $client)
    {
        return Inertia::render('Projects/Index', [
            'client' => $client,
            'projects' => $client->projects->load('tasks')

select * from `tasks` where `tasks`.`project_id` in (24)
---
    public function show(Client $client, Project $project)
    {
        return Inertia::render('Projects/Show', [
            'client' => $client,
            'project' => $project->load('tasks', 'work_entries', 'comments.commenter')