app/Http/Controllers/ClientController.php

select * from `clients` where `clients`.`user_id` = 1 and `clients`.`user_id` is not null
---
    public function index()
    {
        return Inertia::render('Clients/Index', [
            'clients' => auth()->user()->clients()->latest()->get()
        ]);

select * from `projects` where `projects`.`client_id` in (1) order by `created_at` desc limit 5
---
    public function show(Client $client)
    {
        return Inertia::render('Clients/Show', [
            'clients' => auth()->user()->clients()->latest()->get(),
            'client' => $client->load(['projects' => function ($query) {
                $query->latest()->take(5);
            }, 'contacts' => function ($query) {
                $query->orderBy('order', 'asc')->orderBy('updated_at', 'desc');
            }])

update `clients` set `company_name` = 'Crucial Coders', `address` = '500 Cortner Dr', `city` = 'Smithton', `zip` = '62285', `phone_number` = '1(618)741-3452', `website` = 'https://crucialcoders.com', `clients`.`updated_at` = '2019-12-26 19:11:49' where `id` = 1
---
    public function store(Request $request)
    {
        $this->validateRequest($request);

        $client = Client::make($request->all());

        auth()->user()->clients()->save($client);