app/Http/Controllers/ProjectController.php

    public function index()
    {
        return Inertia::render('Projects/All', [
            'projects' => Project::with('client')->where('user_id', auth()->user()->id)->get()
        ]);
---
select * from `clients` where `clients`.`id` in (1, 2, 3, 4, 5)
select * from `projects` where `user_id` = 1